import math
print(math.pi, math.e)                              #загальні константи
print(math.sin(2 * math.pi / 180))                  #синус, тангенс, косинус
print(math.sqrt(144), math.sqrt(2))                 #квадратний корінь
print(pow(2, 4), 2 ** 4, 2.0 ** 4.0)                #взведення в степінь
print(abs(-42.0), sum((1, 2, 3, 4)))                #абсолютне значення, сумування
print(min(3, 1, 2, 4), max(3, 1, 2, 4))             #мінімум, максимум

print(math.floor(2.567), math.floor(-2.567))        #заокруглення в меншу сторону(до меншого цілого)
print(math.trunc(2.567), math.trunc(-2.567))        #усічення(відкидування десяткових цифр)
print(int(2.567), int(-2.567))                      #усічення(перетворення в ціле число)
print(round(2.567), round(2.467), round(2.567, 2))  #округлення
print('%.1f' % 2.567, '{0:.2f}'.format(2.567))      #округлення для відображення

